import React, { useState } from "react";
import { useNavigate } from "react-router-dom";
import Header from "../../components/Header/Header";
import sendIcon from "../../assets/images/send-icon1.png";

const settlements = [
  "אביחיל",
  "אחיטוב",
  "אלישיב",
  "אומץ",
  "בארותיים",
  "בורגתה",
  "בית הלוי",
  "בית חרות",
  "בית ינאי",
  "בית יצחק",
  "ביתן אהרון",
  "גאולי תימן",
  "גבעת שפירא",
  "גן יאשיה",
  "הדר עם",
  "חבצלת השרון",
  "חוגלה",
  "חיבת ציון",
  "חניאל",
  "חרב לאת",
  'כפר הרא"ה',
  "כפר ויתקין",
  "כפר חיים",
  "כפר ידידיה",
  "כפר מונאש",
  "מכמורת",
  "עולש",
  "בחן",
  "גבעת חיים איחוד",
  "גבעת חיים מאוחד",
  "המעפיל",
  "העוגן",
  "מעברות",
  "משמר השרון",
  "עין החורש",
  "בת חפר",
  "בת חן",
  "חופית",
  "יד חנה",
  "צוקי ים",
  "שושנת העמקים",
];

const topics = [
  "תברואה - פח ירוק חדש/שבור",
  "תברואה - אי פינוי פח ירוק",
  "חניה - בירורים על חוב / עיקול/דחיית ערעור/בירורים על סיבת הדוח",
  "פניות תושבים",
  "תברואה - אי פינוי פח כתום",
  "רישום ובירורים לגני ילדים",
  "תשלומים",
  "סתימה\\גלישת ביוב",
  "פניות תושבים כללי",
  "הנדסה - סוגיות תכנון ורישוי",
  "הכנסות – ארנונה",
  "תברואה - הדברה בגני ילדים",
  "הכנסות – תשלומים",
  "תברואה - אי פינוי פח חום",
  "הנדסה - מבנים מסוכנים/בנייה מסוכנת",
  "תברואה - אי פינוי נייר - פח כחול",
  "תברואה - הדברה במוסדות חינוך",
  "מחלקת גני ילדים - חיפוש עובדים",
  "הנדסה - חיפוש עובדים",
  "חתולים",
  "תברואה - פינוי פגר",
  "תברואה - דיווח על חומרים מסוכנים",
  "תברואה - בעיית זבובים",
  "תברואה - אי פינוי נייר - תפוזית",
  "תקיפת בעלי חיים",
  "רפרנטית הנדסה",
  "הכנסות – אגרות והיטלים",
  "תשתיות ובינוי ציבורי - מפגעים בכבישי המועצה",
  "צהרונים וקייטנות",
  "טיפול בחיות בר",
  "הנהלת חשבונות",
  "מחלקת חינוך - חיפוש עובדים",
  "פיקוח רב תכליתי - רכב נטוש",
  "תחבורה - הסעות תלמידים",
  "תברואה - הדברה ביישובים",
  "דיווח על נשיכה/שריטה",
  "מחלקת תברואה - חיפוש עובדים",
  "הכנסות – הנחה בארנונה",
  "כלב משוטט",
  "תברואה - ריח חריג",
  "חיסונים/בירורים/עיקורים/סירוסים",
  "תברואה - פסולת אלקטרונית",
  "הנדסה - וועדות תנועה",
  "ועדה חקלאית - מפגעים כלליים",
  "מחלקת תחבורה - חיפוש עובדים",
  "מחלקת הכנסות - חיפוש עובדים",
  "תברואה - פח חום חדש/שבור",
  "הנדסה - חריגות בניה",
  "פיקוח רב תכליתי - השלכת פסולת או גזם ברשות היחיד/רבים",
  "מפגעי נוף",
  "פיקוח רב תכליתי - חניה לא חוקית",
  "תברואה - פח כתום חדש/שבור",
  "מחלקת פיקוח רב תכליתי - חיפוש עובדים",
  "פיצוץ מים",
  "תברואה - פח לא הוחזר למקום",
  "תברואה - קומפוסטר",
  "מפגעי גינון",
  "כלבים/העברת בעלות/בירורים",
  "בירור בנושא לכידת בעלי חיים",
  "תברואה - בעיית יתושים",
  "חופי ים בעיה מול זכין - חוף מלוכלך",
  "תברואה - הדברה במבני ציבור",
  "חופי ים - תלונות הציבור",
  "גני ילדים - הדברה",
  "גני ילדים - נחשים ועקרבים",
  "מחלקת מים - חיפוש עובדים",
  "חופי ים - מסיבה על החוף",
  "מחלקת הנהלת חשבונות - חיפוש עובדים",
  "תשלומי קופה",
  "הנהלת חשבונות – ספקים קבלנים",
  "פיקוח רב תכליתי - עסקים בירורים",
  "כריתת עץ",
  'ממ"ד',
  "תברואה - אי פינוי סוללות",
  "נזילות מים",
  'חכ"ל - פניות/כללי',
  "פיקוח רב תכליתי - הפרעה לסדר ציבורי",
  "תברואה - ניקיון",
  "תברואה - אי פינוי קרטון",
  "פגרי ציפורים ובעלי כנף - קדחת הנילוס המערבי",
  "פיקוח רב תכליתי - זולות/חושות/קרוונים",
  "תשתיות ובינוי ציבורי - חיפוש עובדים",
  "מכסה ביוב/שבור",
  "הנדסה - בקשות להיתרי בניה",
  'לשכת מנכ"ל - פניות תושבים כללי',
  "חופי ים - פניות כללי",
  "מידע ובירורים כללי על המרכז הקהילתי",
  "הנדסה - פריצת מחסום",
  "החלפת שעונים",
  "ותיקים",
  "משאבת ביוב תקולה",
  "הנהלת חשבונות – ספקים אחרים",
  "ספורט - אירועי ספורט במסגרת העמותה/המועצה",
  'מחלקת חכ"ל - חיפוש עובדים',
  "הכנסות - תלונות הציבור",
  "פיקוח רב תכליתי - רעש מפוח",
  "פיקוח רב תכליתי - עסקים תלונה",
  "הנדסה - השבחה",
  "נוער",
  "ריח ביוב",
  "ביוב הדברה",
  "פיצוץ מים בקו ראשי",
  "תברואה - תגבור פח למשפחה אבלה",
  "ספורט - ביטול השתתפות בפעילויות ספורט",
  "בעיות\\תלונות ושאלות פארק תעשיות",
  "תשתיות ובינוי ציבורי - מפגעי חשמל ותאורה",
  "וטרינריה - חיפוש עובדים",
  "תברואה - פסולת רגילה",
  "מחלקת גני ילדים - חיפוש עובדים",
  "עבירות צער בעלי חיים",
  "יצירת קשר",
  "אמברוזיה",
  "תחבורה - שכחת חפצים",
  "חופי ים - כלבים משוטטים",
  "וטרינריה - פניות תושבים כללי",
  "תברואה - נמלת האש",
  'הנדסה - תבעו"ת',
  "תברואה - פינוי מכולות בפארקים",
  "מחלקת ספורט - חיפוש עובדים",
  "איחור\\ אי הגעה של הסעה",
  "טאבו\\ שמאות מקרקעין",
  "התחברות למערכת הביוב הרשותית",
  "מחלקת המרכז הקהילתי - חיפוש עובדים",
  "תברואה - זיהום אויר",
  "ספורט - טיפול במתקני ספורט בישובים",
  "תברואה - טוואי התהלוכה",
  "קמין",
  "תרנגולים/טווסים/יונים/בעלי כנף אחרים",
  "פח כחול חדש/שבור",
  "חינוך יסודי מחוננים ומצטיינים",
  "רפרנטית הנדסה - מידע",
  "פיקוח רב תכליתי - חוק הרעש",
  "תברואה - אי פינוי טקסטיל",
  "פיקוח רב תכליתי - שריפה חקלאית",
  "ערעורים על דוחות חניה",
  "חופי ים - הדלקת אש על החוף",
  "פניות הציבור הורים/בירורים/תלונות",
  'לשכת מנכ"ל - תחבורה ציבורית מחסור בקווי אוטובוסים ותחנות',
  "תברואה - אי פינוי זכוכית",
  "שבר קו ביוב",
  "פיקוח רב תכליתי - אכיפה סביבתית ופסולת בשטחים פתוחים",
  "ספורט - תלונות על חוגים/אגודות ספורט",
  "מחלקת חופים - חיפוש עובדים",
  "חופי ים - רכב על החוף",
  "תחרות צילומי עובדים",
  "חינוך מיוחד",
  "הנדסה - מפולת",
  "ספורט - מידע/ורישום פעילויות ספורט של העמותה",
  "תברואה - אי פינוי פח תפעולי (שחור)",
  "רעש ממפעלים",
  "הסעות חינוך מיוחד",
  "הכנסות - חילופי מחזיק בנכס",
  "טפסים",
  'לשכת מנכ"ל - תחבורה ציבורית תדירות הגעת אוטובוסים',
  "תעודת גמר [טופס 4]",
  "תברואה - דיווח על יתוש הטיגריס",
  "צעירים",
  "ספורט - פעילויות ספורט במסגרת בתי הספר של המועצה",
  "חופי ים - בעיות חניה",
  "הסעות מחוננים",
  "תברואה - תגבור פנויים בחגים",
  "ספורט - תלונות הורים/תושבים",
  'לשכת מנכ"ל - חוק חופש המידע',
  "הנהלת חשבונות – יישובים",
  "הנדסה - קרוונים",
  "חניות נכים",
  "מפגעי חתולים במוסדות חינוך",
  "שאלות וערעורים רישום גני ילדים",
  "ספורט - מידע/ורישום פעילויות ספורט של העמותה",
  "גני ילדים - מפגעי גינון ועשבייה",
  "דיג לא חוקי",
  "תברואה - מפגעים כלליים",
  "פיקוח רב תכליתי - פינוי גושית",
  "בית העם כפר ויתקין",
  "פניות/תלונות הורים",
  "מפגעי נגישות",
  "חופי ים - הכנסת כלי זכוכית",
  "אלימות\\טביעה, אירוע חריג או ביטחוני",
  "תחבורה - דיווח על נהיגה חריגה",
  "הנדסה - מפולת",
];

function FormPage() {
  const [selectedSettlement, setSelectedSettlement] = useState("");
  const [date, setDate] = useState("");
  const [error, setError] = useState("");
  const [selectedTopic, setSelectedTopic] = useState("");
  const navigate = useNavigate();

  const handleSubmit = async (e) => {
    e.preventDefault();

    if (!settlements.includes(selectedSettlement)) {
      setError("בחר יישוב מהרשימה בלבד");
      return;
    }
    if (!topics.includes(selectedTopic)) {
      setError("בחר נושא מהרשימה בלבד");
      return;
    }
    if (!date) {
      setError("בחר תאריך ושעה");
      return;
    }

    setError("");

    try {
      const response = await fetch("http://localhost:5001/predict", {
        method: "POST",
        headers: {
          "Content-Type": "application/json",
        },
        body: JSON.stringify({
          settlement: selectedSettlement,
          topic: selectedTopic,
          date: date,
          holiday: 0, // תמיד 0 בשלב הזה
        }),
      });

      if (!response.ok) {
        throw new Error("שגיאה בקבלת תשובה מהשרת");
      }

      const predictionData = await response.json();

      console.log("קיבלנו תשובה מהשרת:", predictionData);

      // עכשיו ננווט עם המידע שקיבלנו לדשבורד
      navigate("/dashboard", { state: { predictionData } });
    } catch (error) {
      console.error("שגיאה בשליחת הבקשה:", error);
      setError("הייתה שגיאה בשליחת הבקשה לשרת");
    }
  };

  return (
    <>
      <Header />
      <div className="form-container">
        <h1 className="form-title">מוקד המועצה</h1>
        <form onSubmit={handleSubmit} className="form">
          <div className="form-wrapper-content">
            <label className="form-label">
              יישוב המפגע:
              <input
                list="settlement-options"
                value={selectedSettlement}
                onChange={(e) => setSelectedSettlement(e.target.value)}
                className="form-input"
                dir="rtl"
                style={{ textAlign: "right" }}
                required
              />
              <datalist id="settlement-options">
                {settlements.sort().map((settlement) => (
                  <option key={settlement} value={settlement} />
                ))}
              </datalist>
            </label>
            <label className="form-label">
              נושא הפנייה:
              <input
                list="topic-options"
                value={selectedTopic}
                onChange={(e) => setSelectedTopic(e.target.value)}
                className="form-input"
                dir="rtl"
                style={{ textAlign: "right" }}
                required
              />
              <datalist id="topic-options">
                {topics.sort().map((topic) => (
                  <option key={topic} value={topic} />
                ))}
              </datalist>
            </label>

            <label className="form-label">
              תאריך ושעה:
              <input
                type="datetime-local"
                value={date}
                onChange={(e) => setDate(e.target.value)}
                className="form-input"
                dir="rtl"
                style={{ textAlign: "right" }}
                required
              />
            </label>

            {error && <div className="form-error">{error}</div>}
            <button type="submit" className="submit-button">
              <img src={sendIcon} alt="שלח" />
              שלח/י
            </button>
          </div>
        </form>
      </div>
    </>
  );
}

export default FormPage;
